Repository: felnanuke2/rapid-crak
Catalog: lib/l10n/app_*.arb
Languages: pt_br

# appTitle
source: Password Cracker - Brute Force
pt_br: Quebra de Senha - Brute Force

source: No result
pt_br: Sem resultado

source: ✓ PASSWORD FOUND
pt_br: ✓ SENHA ENCONTRADA

source: ✗ PASSWORD NOT FOUND
pt_br: ✗ NÃO ENCONTRADA

source: STATISTICS
pt_br: ESTATÍSTICAS

source: Total Time
pt_br: Tempo Total

source: Attempts
pt_br: Tentativas

source: Speed
pt_br: Velocidade

source: State
pt_br: Estado

source: Password copied!
pt_br: Senha copiada!

source: Copy Password
pt_br: Copiar Senha

source: New Search
pt_br: Nova Busca

source: Try Again
pt_br: Tentar Novamente

source: New File
pt_br: Novo Arquivo

source: Loading...
pt_br: Carregando...

# processingPassword
source: Processing...
pt_br: Processando...

# passwordNotFoundMessage
source: Password not found with current settings.
pt_br: Senha não encontrada com as configurações atuais.

# bruteForcingStrategy
source: Brute Force Strategy
pt_br: Estratégia de Força Bruta

# numbers
source: Numbers (0-9)
pt_br: Números (0-9)

# lowercase
source: Lowercase (a-z)
pt_br: Minúsculas (a-z)

# uppercase
source: Uppercase (A-Z)
pt_br: Maiúsculas (A-Z)

source: Symbols (!@#...)
pt_br: Símbolos (!@#...)

source: Password Length
pt_br: Comprimento da Senha

source: {min} - {max} characters
pt_br: {min} - {max} caracteres

# warningLongPasswords
source: Warning: Long passwords may take hours/days on mobile.
pt_br: Atenção: Senhas longas podem levar horas/dias no celular.

source: Attack in Progress
pt_br: Ataque em Progresso

source: Starting...
pt_br: Iniciando...

source: RUNNING
pt_br: RODANDO

source: PAUSED
pt_br: PAUSADO

# waitingAttempts
source: Waiting for attempts...
pt_br: Aguardando tentativas...

# configureAttack
source: Attack Configuration
pt_br: Configuração do Ataque

source: Optimization Tip
pt_br: Dica de Otimização

# optimizationMessage
source: The fewer character options and shorter the length, the faster the attack.
pt_br: Quanto menos opções de caracteres e menor o comprimento, mais rápido será o ataque.

# startAttack
source: START PASSWORD CRACKING
pt_br: INICIAR QUEBRA DE SENHA

source: Back
pt_br: Voltar

# selectProtectedFile
source: Select a protected file
pt_br: Selecione um arquivo protegido

# supportedFormats
source: Supported formats: {formats}
pt_br: Formatos suportados: {formats}

source: Import File
pt_br: Importar Arquivo

# passwordCrackerTitle
source: 🔐 PASSWORD CRACKER
pt_br: 🔐 QUEBRA DE SENHA

# bruteForceRealTime
source: Brute Force in Real Time
pt_br: Força Bruta em Tempo Real

source: Invalid configuration
pt_br: Configuração inválida

# error
source: Error: {message}
pt_br: Erro: {message}

# passwordStrength
source: Password Strength Analysis
pt_br: Análise de Força da Senha

source: WEAK PASSWORD
pt_br: SENHA FRACA

source: MODERATE PASSWORD
pt_br: SENHA MODERADA

source: STRONG PASSWORD
pt_br: SENHA FORTE

source: VERY STRONG PASSWORD
pt_br: SENHA MUITO FORTE

# weakPasswordMessage
source: This configuration indicates a weak password. The attack should succeed quickly (under 1 minute).
pt_br: Esta configuração indica uma senha fraca. O ataque deve ter sucesso rapidamente (menos de 1 minuto).

# moderatePasswordMessage
source: This configuration indicates a moderate password. The attack may take up to {minutes} minutes.
pt_br: Esta configuração indica uma senha moderada. O ataque pode levar até {minutes} minutos.

# strongPasswordMessage
source: This configuration indicates a strong password. The attack may take up to {hours} hours.
pt_br: Esta configuração indica uma senha forte. O ataque pode levar até {hours} horas.

# veryStrongPasswordMessage
source: This configuration indicates a VERY STRONG password (est. {duration}). Brute-force is IMPRACTICAL with common devices. This app is effective only for WEAK passwords (4-6 characters).
pt_br: Esta configuração indica uma SENHA MUITO FORTE (est. {duration}). Força bruta é IMPRATICÁVEL em dispositivos comuns. Este app é efetivo apenas para SENHAS FRACAS (4-6 caracteres).

# veryStrongPasswordMessageYears
source: This configuration indicates a VERY STRONG password (est. {years} years). Brute-force is IMPRACTICAL with common devices. This app is effective only for WEAK passwords (4-6 characters).
pt_br: Esta configuração indica uma SENHA MUITO FORTE (est. {years} anos). Força bruta é IMPRATICÁVEL em dispositivos comuns. Este app é efetivo apenas para SENHAS FRACAS (4-6 caracteres).

# passwordConfigurationInfo
source: Configuration: {minLength}-{maxLength} chars • Charset: {charsetSize} characters
pt_br: Configuração: {minLength}-{maxLength} chars • Charset: {charsetSize} caracteres

# appEffectiveFor
source: This app is most effective for passwords under 7 characters.
pt_br: Este app é mais efetivo para senhas com menos de 7 caracteres.

# estimatedDays
source: {days} days
pt_br: {days} dias

source: Last Password
pt_br: Última Senha

# consoleAttempts
source: Attempts
pt_br: Tentativas

# consoleSpeed
source: Speed
pt_br: Velocidade

# consoleElapsed
source: Elapsed
pt_br: Decorrido

# unsupportedFileExtension
source: Unsupported file. Use .zip, .pdf, .rar or .7z
pt_br: Arquivo não suportado. Use .zip, .pdf, .rar ou .7z

# minLengthGreaterThanMax
source: Minimum length cannot be greater than maximum
pt_br: Comprimento mínimo não pode ser maior que o máximo

# maxLengthWarning
source: Maximum recommended length is 16 (too long)
pt_br: Comprimento máximo recomendado é 16 (muito longo)

# passwordsPerSecond
source: {count} passwords/sec
pt_br: {count} senhas/seg

# attemptedLabel
source: attempted
pt_br: testadas

source: No password found
pt_br: Nenhuma senha encontrada

# attackError
source: Attack error: {message}
pt_br: Erro no ataque: {message}

# unsupportedFileType
source: Unsupported file type. Use: {formats}
pt_br: Tipo de arquivo não suportado. Use: {formats}

source: Empty file
pt_br: Arquivo vazio

# fileTooLarge
source: File too large (maximum 5GB)
pt_br: Arquivo muito grande (máximo 5GB)

# fileReadError
source: Could not read file bytes
pt_br: Não foi possível ler os bytes do arquivo

# fileSelectError
source: Error selecting file: {error}
pt_br: Erro ao selecionar arquivo: {error}
